tap "github/gh"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
cask_args appdir: "/Applications"

# High priority

# Git
brew "gh"
brew "git"
brew "git-delta"

brew "bat" # `cat` in Rust
brew "gnupg" # OpenPGP
brew "starship"
brew "tmux"
brew "zoxide" # smarter `cd` in Rust

cask "alacritty"
cask "arc"
cask "cursor"
cask "obsidian"

# Window Manager / Key Bindings
brew "skhd"
brew "yabai"

# mas "Bitwarden", id: 1137397744 # this didn't work. manually installed instead.
mas "Xcode", id: 497799835

# Low priority

# GNU
brew "cmake"
brew "coreutils"
brew "curl"
brew "grep"

# brew "fd" # `find` in Rust
# brew "lf" # file manager
# brew "sd" # `sed` in Rust
# brew "tealdeer" # `tldr` in Rust

# Language / Shell / Build tool
# brew "asdf"
# brew "bazelisk"
brew "bun"
brew "go"
brew "nushell"
# brew "protobuf"
# brew "python@3.11"
brew "rust-analyzer"
brew "zsh"

# DB
# brew "atlas"
# brew "postgresql@14"

# Neovim
cask "font-hack-nerd-font"
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "sk" # Fuzz Finder in Rust

brew "git-cliff"
brew "jq"
brew "mas"
# brew "zola"

# Monitoring / Analytics
# brew "bandwhich"
# brew "bottom" # `htop` in Rust
# brew "hyperfine" # benchmarking
# brew "ncdu" # NCurses Disk Usage
# brew "procs" # `ps` in Rust
# brew "tokei" # code counter

# Communication
cask "discord"
cask "signal"
# cask "slack"
cask "telegram"
cask "zoom"

# Design
# cask "blender"
cask "figma"

# cask "docker"
cask "firefox"
cask "brave-browser"
cask "google-chrome"
cask "google-cloud-sdk"
# cask "google-japanese-ime"
cask "insomnia"
# cask "protonvpn"
cask "visual-studio-code"

# Crypto
# brew "ethereum" # geth
cask "ledger-live"

# Music Production
cask "elektron-overbridge"
cask "sysex-librarian"

# Game
cask "minecraft"
cask "steam"

mas "Final Cut Pro", id: 424389933
mas "Vimari", id: 1480933944
mas "GoPro Player + HyperSmooth Pro", id: 1460836908
mas "Amazon Kindle", id: 302584613

# Mobile development
cask "expo-orbit"
