tap "cjbassi/ytop"
tap "convco/formulae"
tap "extrawurst/tap"
tap "facebook/fb"
tap "github/gh"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"
cask_args appdir: "/Applications"

# High priority

brew "asdf"
brew "bat"
brew "exa"
brew "fd"
brew "git"
brew "git-delta"
brew "gh"
brew "lf"
brew "neovim"
brew "starship"
brew "tmux"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"

cask "alacritty"
cask "1password"
cask "visual-studio-code"
cask "brave-browser"
cask "obsidian"
cask "slack"

brew "skhd"
brew "yabai"

# mas "Bitwarden", id: 1137397744 # this didn't work. manually installed instead.
mas "Xcode", id: 497799835

# Low priority

brew "applesimutils"
brew "bandwhich"
brew "cmake"
brew "convco"
brew "coreutils"
brew "curl"
brew "fzf"
brew "git-cliff"
brew "grep"
brew "htop"
brew "hyperfine"
brew "ios-deploy"
brew "jq"
brew "mas"
brew "ncdu"
brew "nushell"
brew "pnpm"
brew "procs"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "sd"
brew "sk"
brew "tealdeer"
brew "tokei"
brew "idb-companion"
brew "watchman"
brew "ytop"
brew "zola"

cask "android-studio"
cask "blender"
cask "discord"
cask "docker"
cask "figma"
cask "flipper"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
# cask "google-japanese-ime"
cask "insomnia"
cask "ledger-live"
cask "minecraft"
cask "protonvpn"
cask "signal"
cask "steam"
cask "zoom"
cask "zulu11"

mas "Final Cut Pro", id: 424389933
mas "Vimari", id: 1480933944
